Repository: 84000/data-translation-memory
Catalog: toh217-v3.tmx
Source language: bo
Languages: en

source: ཁྱོད་འདི་སྙམ་དུ་བདག་ནི་སྐྱེས་པ་གཞན་ལ་ཆགས་པར་གྱུར་ལ།
en: You thought, “I’ve become attracted to another man, and this bird knows about it.

source: བྱ་འདིས་ཤེས་ཏེ་འདི་ཡང་མི་སྐད་སྨྲ་བས་འདིས་གཏམ་འདི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ལ་མི་བསྙད་གྲང་།
en: Since he speaks the human language, might he not tell this tale to the king?

source: རྒྱལ་པོས་བདག་བཟུང་སྟེ་མི་བསད་གྲང་སྙམ་དུ་བསམས་ནས། དེའི་ཕྱིར་ཁྱོད་ཀྱིས་ང་ལ་ཟས་དུག་ཅན་དང་། སྐོམ་དུག་ཅན་བྱིན་ཏེ། ཁྱོད་ཀྱིས་ང་གསད་པར་མི་ནུས་སོ།
en: Might the king not arrest and execute me?” So you gave me food and drink laced with poison, but you cannot kill me.’

source: །དེ་ནས་བཙུན་མོ་དཔེ་མེད་དེས་ཚིག་དེ་ཐོས་ནས་ཁ་བུབ་ཏུ་འགྱེལ་ཏེ་ཁྲག་དྲོན་པོ་སྐྱུགས་ནས་ནད་ཚབས་ཆེན་པོས་བཏབ་སྟེ།
en: “When she heard this, Queen Anupamā fell face down, vomited warm blood, and was seized by a serious illness that led to her death.

source: ནད་དེ་ཉིད་ཀྱིས་ཤི་བའི་དུས་བྱས་སོ། །དེ་ཤི་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ངུ་འབོད་དུ་སྐྱེས་པར་གྱུར་ཏོ།
en: After her death, she was born as a denizen of the Hell of Loud Screams.

source: །ཁྱིམ་བདག་དེའི་ཚེ་དེའི་དུས་ན་གྲོང་ཁྱེར་ཆེན་པོ་བཱ་རཱ་ཎ་སཱིའི་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Householder, if you suspect or have doubts that Brahmadatta, the king of the great city of Vārāṇasī at that time, was someone else, reconsider.

source: དགེ་སློང་ཤཱ་རིའི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཚངས་པས་བྱིན་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: The monk Śāriputra was King Brahmadatta at that time.

source: །ཁྱིམ་བདག་དེའི་ཚེ་དེའི་དུས་ན་བཙུན་མོ་དཔེ་མེད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Householder, if you suspect or have doubts that the queen Anupamā at that time was someone else, reconsider.

source: བྲམ་ཟེའི་བུ་མོ་གཡོ་མ་དེ་དེའི་ཚེ་དེའི་དུས་ན་བཙུན་མོ་དཔེ་མེད་དུ་གྱུར་ཏོ། །ཁྱིམ་བདག་དེའི་ཚེ་དེའི་དུས་ན་རིའི་རྒྱལ་པོ་གངས་རིའི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་ལ་གནས་པའི་རྨ་བྱའི་རྒྱལ་པོ་གསེར་དུ་སྣང་བ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: The deceitful brahmin maiden was Queen Anupamā at that time. Householder, if you suspect or have doubts that the peacock king Suvarṇāvabhāsa who lived on the southern slope of the snowy king of mountains was someone else, reconsider.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རིའི་རྒྱལ་པོ་གངས་རིའི་ལྷོ་ཕྱོགས་ཀྱི་ངོས་ལ་གནས་པ་རྨ་བྱའི་རྒྱལ་པོ་གསེར་དུ་སྣང་བ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: I myself, at that time, was Suvarṇāvabhāsa, the peacock king who lived on the southern slope of the snowy king of mountains.

source: །ཁྱིམ་བདག་དེའི་ཚེ་དེའི་དུས་ན་རྨ་བྱ་ལྔ་བརྒྱར་གྱུར་པ་དེ་དག་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Householder, if you suspect or have doubts that the five hundred peacocks were some other beings, reconsider.

source: དགེ་སློང་མཆོག་ལྔ་བརྒྱ་པོ་འདི་དག་དེའི་ཚེ་དེའི་དུས་ན་རྨ་བྱ་ལྔ་བརྒྱར་གྱུར་ཏོ།
en: The five hundred excellent monks in my retinue here were the five hundred peacocks at that time.

source: །ཁྱིམ་བདག་ང་དུད་འགྲོའི་སྐྱེ་གནས་སུ་གྱུར་པ་དེའི་ཚེ་ཡང་ལུས་ལ་དུག་གིས་མ་ཚུགས་ན།
en: “Householder, poison could not physically affect me even then, when I was born as an animal;

source: ད་ལྟར་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལྟ་ལ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ།
en: how much less so now that I am a completely awakened buddha?

source: །དེ་བས་ན་ཁྱིམ་བདག་ཚིགས་སུ་བཅད་པ་བརྗོད་པ་བྱས།
en: Therefore, householder, listen carefully and retain the following verses.

source: དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་ཀྱིས་ལེགས་པར་རབ་ཏུ་ཟུང་ལ་ཟས་ལ་ལན་གསུམ་བཟླས་པ་གྱིས་ཏེ།
en: I will teach them to you; remember them carefully and recite them three times over the food, and then distribute it to the assembly of monks.

source: དགེ་སློང་གི་དགེ་འདུན་ལ་བྲིམས་ཤིག །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་རྣམས།
en: “Attachment, anger, and delusion:

source: །དེ་དག་འཇིག་རྟེན་དུག་གསུམ་སྟེ།
en: These are the three worldly poisons.

source: །བཅོམ་ལྡན་སངས་རྒྱས་དུག་མེད་པ།
en: The blessed Buddha is without poison;

source: །སངས་རྒྱས་བདེན་པས་དུག་བཅོམ་མོ།
en: The Buddha’s truth conquers poison.

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་རྣམས།
en: “Attachment, anger, and delusion:

source: །བཅོམ་ལྡན་ཆོས་ནི་དུག་མེད་པ།
en: The blessed Dharma is without poison;

source: །ཆོས་ཀྱི་བདེན་པས་དུག་བཅོམ་མོ།
en: The Dharma’s truth conquers poison.

source: །བཅོམ་ལྡན་དགེ་འདུན་དུག་མེད་པ།
en: The blessed Saṅgha is without poison;

source: །དགེ་འདུན་བདེན་པས་དུག་བཅོམ་མོ།
en: The Saṅgha’s truth conquers poison. “By the truth of these words—

source: །བདེན་པ་གང་གིས་ང་སངས་རྒྱས།
en: The truth that I am a buddha,

source: །འཇིག་རྟེན་ཀུན་ལ་བླ་ན་མེད།
en: Unsurpassed in the world— May poison not harm me!

source: །བདེན་པའི་ཚིག་ནི་དེ་ཡིས་སུ།
en: “By the truth of these words—

source: །ང་ལུས་དུག་གིས་མི་ཚུགས་ཤོག །བདེན་པ་གང་གིས་ང་ཡི་ཆོས།
en: The truth that my Dharma

source: །ང་ལུས་དུག་གིས་མི་ཚུགས་ཤོག །བདེན་པ་གང་གིས་ངའི་དགེ་འདུན།
en: The truth that my Saṅgha

source: །འཇིག་རྟེན་ཀུན་ལ་བླ་ན་མེད། །བདེན་པའི་ཚིག་ནི་དེ་ཡིས་སུ།
en: Is unsurpassed in the world—

source: །ང་ལུས་དུག་གིས་མི་ཚུགས་ཤོག །ཤིང་གང་དུག་དང་བཅས་རྣམས་དང་། །སྲོག་ཆགས་གང་དག་དུག་བཅས་པ།
en: May poison not harm me! “All the poisonous trees And all the poisonous animals

source: །དེ་ཀུན་འདོད་ཆགས་དུག་ལས་བྱུང་།
en: Arise from the poison of desire;

source: །འདོད་ཆགས་འདི་ནི་དུག་གི་མཆོག །ཤིང་གང་དུག་དང་བཅས་རྣམས་དང་། །སྲོག་ཆགས་གང་དག་དུག་བཅས་པ།
en: Desire is the worst poison. “All the poisonous trees And all the poisonous animals

source: །དེ་ཀུན་ཞེ་སྡང་དུག་ལས་བྱུང་།
en: Arise from the poison of anger;

source: །ཞེ་སྡང་འདི་ནི་དུག་གི་མཆོག །ཤིང་གང་དུག་དང་བཅས་རྣམས་དང་། །སྲོག་ཆགས་གང་དག་དུག་བཅས་པ།
en: Anger is the worst poison. “All the poisonous trees And all the poisonous animals

source: །དེ་ཀུན་གཏི་མུག་དུག་ལས་བྱུང་།
en: Arise from the poison of delusion;

source: །གཏི་མུག་འདི་ནི་དུག་གི་མཆོག །དྲག་པོའི་དུག་གིས་དུག་བཅོམ་སྟེ།
en: Delusion is the worst poison. “The buddhas have conquered the fiercest poisons;

source: །བསྲུང་དང་ཡོངས་སུ་གཟུང་བ་བྱས།
en: They have protected and shielded us from them.

source: །སངས་རྒྱས་ཀུན་གྱིས་དུག་བཅོམ་པས།
en: Because all buddhas have conquered poisons,

source: །རྫོགས་སངས་རྒྱས་ལ་སྐྱབས་སུ་དོང་།
en: I take refuge in the perfectly awakened ones. “Perform it in that manner.”

source: །དེ་དེ་བཞིན་བགྱིའོ་ཞེས་ཏེ་ཁྱིམ་བདག་དཔལ་སྦས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་ལེགས་པར་རབ་ཏུ་བླངས་ཏེ། བླངས་ནས་ཟས་དེ་དག་ལ་ལན་གསུམ་བཟླས་ཏེ།
en: The householder Śrīgupta accepted these verses in the presence of the Blessed One and recited them three times over the food.

source: རང་གི་ལག་གིས་ཞལ་ཟས་བསོད་པ་མང་པོ་དགེ་སློང་གི་དགེ་འདུན་ལ་བསྟབས་ཏེ་ཚིམ་པར་བྱས་སོ། །དེ་ནས་ཁྱིམ་བདག་དཔལ་སྦས་ཀྱིས་བཅོམ་ལྡན་འདས་དང་། དགེ་སློང་གི་དགེ་འདུན་བཤོས་གསོལ་ཟིན་ཏེ། ཕྱག་བཅབས་ལྷུང་བཟེད་གྱུ་བར་རིག་ནས་སྟན་ཞིག་བླངས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: He then served many pleasing dishes to the assembled monks with his own hands, so that they were satisfied. When the householder Śrīgupta learned that the Blessed One and the assembled monks had finished their meals and had washed their hands and put their alms bowls away, he rose from his seat and sat to one side.

source: །ཁྱིམ་བདག་དཔལ་སྦས་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་གཏམ་རིམ་གྱིས་མཛད་པ་འདི་ལྟ་སྟེ།
en: With Śrīgupta seated to the side, the Blessed One spoke to him about the following subjects in sequence:

source: གང་འདི་སྦྱིན་པའི་གཏམ་དང་། ཚུལ་ཁྲིམས་ཀྱི་གཏམ་དང་། མཐོ་རིས་ཀྱི་གཏམ་དང་། འདོད་པའི་ཉེས་དམིགས་དང་། དེའི་འོག་ཏུ་ཟག་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། མངོན་པར་འབྱུང་བའི་ཕན་ཡོན་དང་། རྣམ་པར་བྱང་བའི་ཕྱོགས་སོ།
en: generosity, moral discipline, higher rebirth, the faults of desire and the pollutions that flow from it, impurity, the benefits of renunciation, and purity.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དཔལ་སྦས་ལ་རྒྱ་ཆེར་རབ་ཏུ་བསྟན།
en: The Blessed One then instructed the householder Śrīgupta in greater detail;

source: རབ་ཏུ་འཇོག །རྣམ་པར་འགྲེལ། རྣམ་པར་འབྱེད། གསལ་བར་མཛད་དོ།
en: he set forth, explained, classified, and clarified.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གང་གི་ཚེ་ཁྱིམ་བདག་དཔལ་སྦས་སེམས་དགའ་བ་དང་། སེམས་མཉེན་པ་དང་། སེམས་དགེ་བ་དང་། སྒྲིབ་པ་མེད་པའི་སེམས་སུ་གྱུར་པར་མཁྱེན་པ་དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཡང་དག་ཕུལ་གྱི་ཆོས་གང་སྟོན་པ་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱིམ་བདག་དཔལ་སྦས་ལ་རྒྱ་ཆེར་རབ་ཏུ་བསྟན། རབ་ཏུ་བཞག །རྣམ་པར་བཀྲོལ། རྣམ་པར་ཕྱེ། གསལ་བར་མཛད། རབ་ཏུ་བཤད་དོ།
en: When he realized that the householder Śrīgupta’s mind had become joyful, flexible, virtuous, and unpolluted, the Blessed One instructed, set forth, explained, classified, clarified, and explained in still greater detail the most sublime teachings taught by the blessed buddhas.

source: །དེ་ནས་ཁྱིམ་བདག་དཔལ་སྦས་སྟན་དེ་ལ་འདུག་བཞིན་དུ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་ཏེ། འདི་ལྟ་སྟེ།
en: While still on his seat, the householder Śrīgupta developed the dustless and unobscured Dharma eye.

source: དཔེར་ན་རས་ནག་པོའི་བག་མེད་པ། ཁ་བསྒྱུར་བར་འོས་པ་ཚོན་གྱི་ནང་དུ་བཅུག་ན་ཚོན་ལེགས་པར་འཇེན་པ་དེ་བཞིན་དུ་ཁྱིམ་བདག་དཔལ་སྦས་ཀྱང་སྟན་དེ་ལ་འདུག་བཞིན་དུ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ།
en: Just as a piece of fabric that has carelessly become stained but is fit to be dyed will thoroughly absorb the color it is soaked in, so did the householder Śrīgupta, seated on his seat, develop the dustless and unobscured Dharma eye in connection with the teachings.

source: །དེ་ནས་ཁྱིམ་བདག་དཔལ་སྦས་ཀྱིས་ཆོས་མཐོང་། ཆོས་ཐོབ། ཆོས་ཡོངས་སུ་བསྐྱེད། མངོན་དུ་ཡང་དག་པར་རྟོགས།
en: The householder Śrīgupta then perceived, attained, generated, and perfectly realized the Dharma.

source: ནེམ་ནུར་མེད། ཐེ་ཙོམ་དང་བྲལ། སོམ་ཉི་དང་བྲལ། གཞན་གྱི་དྲིང་མི་འཇོག །སྟོན་པའི་བསྟན་པ་ཀུན་ཏུ་ཤེས།
en: Without uncertainty, hesitation, or doubt, and without relying on anyone else, he completely understood the Teacher’s teachings.

source: མི་འཇིགས་པ་ཐོབ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་སློང་གི་དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིའོ།
en: He became fearless, and said to the Blessed One, “Noble sir, Blessed One, I go for refuge in the Buddha, Dharma, and monastic community.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ལ་དགེ་བསྙེན་དུ་གཟུང་དུ་གསོལ།
en: Noble sir, Blessed One, please accept me as a lay devotee.

source: །དེང་ནས་ཇི་སྲིད་འཚོའི་བར་དུ་བདག་གི་སྐྱབས་ཁྱོད་ལགས་ཏེ་སྐྱབས་སུ་མཆིའོ།
en: From today, for as long as I live, you will be my refuge. I take refuge in you.”

source: །དེ་ནས་དགེ་སློང་དེ་དག་ངོ་མཚར་དུ་གྱུར། རྨད་དུ་བྱུང་བར་གྱུར་ཏེ། འདི་ལྟར་ཁྱིམ་བདག་དཔལ་སྦས་བཅོམ་ལྡན་འདས་མེ་དོང་དུ་བསྲེག་པ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་འདོད་པ་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ནས་བཟློག་སྟེ། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་པ་འདི་ནི་ངོ་མཚར་རྨད་དུ་བྱུང་བའོ་སྙམ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The monks were astonished and amazed at how the householder Śrīgupta—who had wished to burn the Blessed One in a pit of fire and was destined to fall into the great hells—had been turned away from the great hells by the Blessed One, and had developed the dustless and unobscured Dharma eye in connection with the teachings.

source: དགེ་སློང་དག་ཁྱིམ་བདག་དཔལ་སྦས་ད་ལྟར་འབའ་ཞིག་ང་མེ་དོང་དུ་བསྲེག་པ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་འདོད་ལ། ངས་དེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ལས་བཟློག་སྟེ། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་པར་ཡང་མ་ཟད་དེ།
en: When he perceived their surprise and wonder, the Blessed One said, “Monks, this is not the only time the householder Śrīgupta wished to burn me in a pit of fire and was destined to fall into the great hells until I turned him away from the great hells so that he would develop the dustless and unobscured Dharma eye in connection with the teachings.

source: དགེ་སློང་དག་གཞན་གྱི་ཚེ་ཡང་ཁྱིམ་བདག་དཔལ་སྦས་ང་མེ་དོང་དུ་བསྲེག་པ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་བར་འདོད་དེ།
en: Monks, in another life as well, the householder Śrīgupta wished to burn me in a pit of fire and was destined to fall into the great hells;

source: ངས་དེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ལས་བཟློག་གོ།
en: then, too, I turned him away from the great hells.”

source: །དགེ་སློང་དེ་དག་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས། ཁྱིམ་བདག་དཔལ་སྦས་གཞན་གྱི་ཚེ་བཅོམ་ལྡན་འདས་ཞུགས་ཀྱི་དོང་དུ་བསྲེགས་ཏེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མ་མཆིས་པར་ལྟུང་བར་འཚལ་ལ། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་ལས་ཐར་བར་མཛད་པ་ཇི་ལྟ་བུ་ལགས།
en: The monks asked, “Noble sir, Blessed One, how did it happen that, in another life, the householder Śrīgupta sought to burn the Blessed One in a pit of fire, and was thus destined to fall into the great Avīci hell, only to have the Blessed One save him from falling into that hell?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཅེས་བྱ་བ་ཚུལ་ཁྲིམས་དང་ལྡན་པ།
en: The Blessed One replied, “Monks, in the past there lived a brahmin boy named Dharmakāma.

source: ཡོན་ཏན་དང་ལྡན་པ།
en: He was morally disciplined and full of good qualities.

source: འདོད་པ་ཆུང་བ། ཆོག་ཤེས་པ།
en: Content, and with little desire, he lived a virtuous life in seclusion.

source: རབ་ཏུ་དབེན་པ། དགེ་བའི་ཆོས་ཅན་ཞིག་བྱུང་སྟེ། བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ནི་གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: The brahmin boy Dharmakāma had a fine figure and was handsome and attractive, with a clear and hearty complexion.

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པའོ། །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་དེ་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། ཁྱིམ་བདག་རྣམས་ཀྱིས་བཀུར་སྟི་བྱས།
en: Brahmins, warriors, and householders all held Dharmakāma in high regard and venerated him;

source: བླ་མར་བྱས་ཏེ་མཆོད་ནས་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་བཟང་པོ་མང་པོ་རྙེད་པར་གྱུར་ཏོ།
en: from them he received abundant offerings of high-quality clothing, food, bedding, and medicines.

source: །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ནི་སྟོང་ཕྲག་བརྒྱས་ཚིགས་སུ་བཅད་པ་གཅིག་ཚོལ་ལོ།
en: The brahmin boy Dharmakāma would refine a single verse a hundred thousand times.

source: །དེ་ནས་བྲམ་ཟེ་ཞིག་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱི་རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་མ་བཟོད་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ངས་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ལ་ལེགས་པར་བཤད་པ་བསྒྲག་པར་བྱའོ། །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་སྨྲས་པ།
en: “A certain brahmin was not able to bear Dharmakāma’s possessions, honor, and literary ability, so he approached him and said, ‘Dharmakāma, there is an eloquent expression I would like to share with you.’

source: འཕགས་པ་ལེགས་པར་བཤད་པ་བདག་ལ་ལེགས་པར་བསྒྲག་ཏུ་གསོལ།
en: “Dharmakāma replied, ‘Noble one, please share this eloquent expression with me.’

source: བྲམ་ཟེས་སྨྲས་པ། ཆོས་འདོད་ངས་ཁྱོད་ལ་དེ་བཞིན་དུ་ལེགས་པར་བཤད་པ་བསྒྲག་ཏུ་མི་རུང་ངོ་། །ཆོས་འདོད་ཀྱིས་སྨྲས་པ།
en: “The brahmin replied, ‘Dharmakāma, this is not the setting for me to share this eloquent expression with you.”

source: འཕགས་པ་འོ་ན་ཁྱོད་ཀྱིས་ལེགས་པར་བཤད་པ་བདག་ལ་ཇི་ལྟར་བསྒྲག་པར་བགྱི།
en: “Dharmakāma said, ‘Well then, noble sir, how would you share this eloquent expression with me?’

source: བྲམ་ཟེས་སྨྲས་པ། གལ་ཏེ་ཆོས་འདོད་ཁྱོད་ཀྱིས་དོང་ཆེན་པོ་རྐོར་བཅུག་ལ། བརྐོས་ནས་མེས་འགེངས་སུ་བཅུག་སྟེ།
en: “The brahmin said, ‘Dharmakāma, have a deep pit dug, and then fill it with fire that is flameless and smokeless.

source: མེ་མི་འབར་ཞིང་དུ་བ་མི་འཐུལ་བས་བཀང་ནས་མཆོད་སྡོང་མཐོན་པོ་འཛུགས་སུ་ཆུག་ལ།
en: Erect a tall sacrificial post in front of the pit, and then hurl yourself into the fire.

source: འཛུགས་སུ་བཅུག་ནས་མེ་དོང་དེར་བདག་ཉིད་མཆོངས་ན་དེ་ལྟ་ན་ངས་ཁྱོད་ལ་ལེགས་པར་བཤད་པ་བསྒྲག་པར་བྱའོ། །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་སྨྲས་པ།
en: If you do this, I will share the eloquent expression with you.’

source: འཕགས་པ་བདག་འདི་ན་ལེགས་པར་བཤད་པ་གང་ཅི་ཚོལ་བ་དེ་ཐམས་ཅད་ནི་སེམས་ཅན་རྣམས་ཀྱི་དོན་གྱི་སླད་དུ་ལགས་ན།
en: “Dharmakāma replied, ‘Noble one, all my efforts in seeking eloquent expressions have been dedicated to the benefit of beings.

source: སློབ་དཔོན་བདག་གིས་ལེགས་པར་བཤད་པ་སེམས་ཅན་རྣམས་ལ་མ་བསྒྲགས་པར་ཇི་ལྟར་མེ་དོང་དུ་མཆོང་བར་བགྱི།
en: So, master, how can I hurl myself into a fire pit without having shared an eloquent expression with beings?’

source: དེ་ནས་བྲམ་ཟེ་དེས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “The brahmin then recited this verse to Dharmakāma:

source: སྔགས་ཚོལ་བདེ་བ་ག་ལ་ཡོད།
en: “ ‘Where one seeks mantras there is happiness;

source: །ག་ལ་བདེ་ཡོད་སྔགས་ཚོལ་བ།
en: Where there is happiness one seeks mantras.

source: །སྔགས་བཙལ་ཕྱིར་ནི་བདེ་བ་འོར།
en: In order to find mantras, give up happiness.

source: །བདེ་བ་འོར་ཅིག་སྔགས་བཙལ་ཕྱིར།
en: Give up happiness in order to find mantras.’

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་བྲམ་ཟེ་དེ་ལ་ཚིགས་སུ་བཅད་དེ་སླར་སྨྲས་པ།
en: “Dharmakāma answered the brahmin with the following verse:

source: བྱང་ཆུབ་ཚོལ་བ་ག་ལ་བདེ།
en: “ ‘Where one seeks awakening there is happiness.

source: །ག་ལ་བདེ་ཡོད་བྱང་ཆུབ་ཚོལ།
en: One seeks awakening where there is happiness.

source: །བྱང་ཆུབ་བཙལ་ཕྱིར་བདེ་བ་འོར།
en: In order to find awakening, give up happiness.

source: །བདེ་འོར་བྱང་ཆུབ་བཙལ་བའི་ཕྱིར།
en: Give up happiness in order to find awakening.’

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་བྲམ་ཟེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སློབ་དཔོན་བདག་ལ་ལེགས་པར་བཤད་པ་ལེགས་པར་བསྒྲགས་སུ་གསོལ།
en: “Then Dharmakāma said to the brahmin, ‘Master, please share an eloquent expression with me.

source: འོན་ཏང་ཁྱོད་གང་བཞེད་པ་དེ་བགྱིའོ།
en: In any case, I will do as you instruct.’

source: །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ལེགས་པར་བཤད་པའི་དོན་གྱི་ཕྱིར་བདག་ཉིད་དོར་བར་འདོད་དོ་ཞེས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་ཐོས་ནས་དེ་དག་ཐམས་ཅད་ངུ་ཞིང་གདོང་ལ་མཆི་མ་ཟག་བཞིན་དུ་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Once they learned that the brahmin boy Dharmakāma intended to sacrifice himself in pursuit of an eloquent expression, the brahmins and householders came to where Dharmakāma lived, all of them weeping, with tears streaming down their faces. Upon arriving, they said to the brahmin boy Dharmakāma, ‘Dharmakāma, do not sacrifice yourself.

source: །ཆོས་འདོད་ཁྱོད་བདག་ཉིད་མ་དོར་ཅིག །ཆོས་འདོད་ཁྱོད་ནི་ཁྱིམ་ན་འདུག་བཞིན་སྦྱིན་པ་སྦྱིན་པ་དང་། བསོད་ནམས་བྱ་བར་ནུས་སོ།
en: Dharmakāma, you can practice generosity and make merit while living as a householder.’

source: །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་བྲམ་ཟེ་དང་ཁྱིམ་བདག་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The brahmin boy Dharmakāma replied to the brahmins and householders, ‘Gentlemen, do not say that.

source: །བཙུན་པ་དག་དེ་སྐད་མ་གསུང་ཤིག །བདག་གིས་སློབ་དཔོན་གྱི་དགོངས་པ་ངེས་པར་བསྐང་བར་བགྱིའོ།
en: I will fulfill the wishes of my master.’

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་མཆོད་སྡོང་ཆེན་པོ་འཛུགས་སུ་བཅུག་སྟེ། མཆོད་སྡོང་ཆེན་པོ་བཙུགས་ནས་དེའི་དྲུང་དུ་དོང་ཆེན་པོ་རྐོར་བཅུག་སྟེ།
en: “Then the brahmin boy Dharmakāma had a tall sacrificial post erected, and had a deep pit dug in front of it.

source: བརྐོས་ནས་མེས་འགེངས་སུ་བཅུག་གོ། །མེ་མི་འབར་ཞིང་དུ་བ་མི་འཐུལ་བས་བཀང་ནས་བྲམ་ཟེ་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །སློབ་དཔོན་བདག་ལ་ལེགས་པར་བཤད་པ་ལེགས་པར་བསྒྲག་ཏུ་གསོལ།
en: He had the pit filled with a flameless and smokeless fire, and said to the brahmin, ‘Master, please share an eloquent expression with me.’

source: དེ་ནས་བྲམ་ཟེ་དེས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ལ་ཚིགས་སུ་བཅད་པ་འདི་ལྟ་བུ་བསྟན་ཏོ།
en: “The brahmin then taught the brahmin boy Dharmakāma verses such as this one:

source: །སྦྱིན་པ་ལ་ནི་རྟག་ཏུ་དགའ་བར་གྱིས།
en: “ ‘Always take joy in generosity;

source: །རྟག་ཏུ་ཚུལ་ཁྲིམས་ཡོངས་སུ་རྫོགས་པར་སྤྱོད།
en: Always practice perfect moral conduct;

source: །བརྩོན་འགྲུས་མཆོག་གི་གནས་ནི་བརྩམ་པར་གྱིས།
en: Always apply supreme diligence—

source: །ཤེས་རབ་ཀྱིས་ནི་ཆོས་མཆོག་དམ་པ་ཐོབ།
en: With wisdom, attain the supreme and holy Dharma.’

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་བྲམ་ཟེ་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་ལེགས་པར་རབ་ཏུ་བཟུང་སྟེ།
en: “When the brahmin boy Dharmakāma had memorized this verse from the brahmin, a large crowd of people gathered.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་བསོགས་སོ། །སྐྱེ་བོ་ཕལ་པོ་ཆེ་བསོགས་ནས་མཆོད་སྡོང་མཐོན་པོའི་ཁར་འཛེགས་ཏེ། སྐྱེ་བོ་ཕལ་པོ་ཆེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་བསྒྲགས་སོ།
en: He then climbed up onto the tall sacrificial post to share the verse with the crowd:

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་སྐྱེ་བོ་ཕལ་པོ་ཆེ་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་བསྒྲགས་ནས་འདི་ལྟ་བུའི་བདེན་པའི་ཚིག་འདི་བྱེད་དེ།
en: “Once he had shared the verse with the crowd, Dharmakāma spoke the following words of truth:

source: སའི་ཕྱོགས་འདི་ན་ལྷ་རྒྱ་ཆེན་པོ་གང་དག་གནས་པ་རྣམས་བདག་ལ་དགོངས་སུ་གསོལ།
en: “ ‘Great gods who dwell in this land, please heed me!

source: ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་བདག་ལ་དགོངས་སུ་གསོལ།
en: All nāgas and yakṣas, gandharvas and asuras, garuḍas, kinnaras, and mahoragas, please heed me!

source: བདག་ནི་གཏོང་བ་བགྱིད་དེ། ཤིན་ཏུ་གཏོང་བ་དང་། གཏོང་བའི་ཡང་གཏོང་བ་དང་། བདག་ཉིད་ཡོངས་སུ་གཏོང་བ་བགྱིད་དོ།
en: I am performing an act of giving, the greatest act of giving, an extreme act of giving—I am giving myself.

source: །བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་བདག་ཡོངས་སུ་གཏོང་བ་བགྱིད་པ་ནི་རྒྱལ་པོའི་སླད་དུ་མ་ལགས།
en: The truth and the words of truth with which I give myself away are these:

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་སླད་དུ་མ་ལགས་ཀྱི།
en: I do this not to acquire the kingdom of a universal monarch.

source: གཞན་དུ་ན་བདག་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་མ་དུལ་བ་རྣམས་གདུལ་བར་བགྱི། མ་རྒལ་བ་རྣམས་བསྒྲལ་བར་བགྱི། མ་གྲོལ་བ་རྣམས་དགྲོལ་བར་བགྱི། དབུགས་མ་ཕྱིན་པ་རྣམས་དབུགས་དབྱུང་བར་བགྱི། ཡོངས་སུ་མྱ་ངན་ལས་མ་འདས་པ་རྣམས་ཡོངས་སུ་མྱ་ངན་ལས་བཟླ་བར་བགྱི་སྙམ་པའི་སླད་དུ་སྟེ།
en: Rather, I do this in order to attain supreme and perfect awakening and reach perfect buddhahood, so that I may tame those beings who are not yet tamed, free those who have not yet gone beyond, liberate those not yet liberated, reassure those who need reassurance, and place beyond suffering those who are still suffering.” By this truth, and by these words of truth, may my self-sacrifice not be fruitless!’

source: བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་བདག་གི་ཡོངས་སུ་གཏོང་བ་འབྲས་བུ་མེད་པར་མ་གྱུར་ཅིག་ཅེས་བྱས་ནས་མེ་དོང་དེར་བདག་ཉིད་མཆོངས་སོ།
en: “With these words, he hurled himself into the fire pit.

source: །དགེ་སློང་དག་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་མེ་དོང་དེར་མཆོངས་མ་ཐག་ཏུ་མེ་དོང་དེའི་མེ་ཤི་སྟེ།
en: “Monks, as soon as the brahmin boy Dharmakāma jumped into the fire pit, the fire within it died out and became a pool of lotuses.

source: པད་མའི་རྫིང་དུ་གྱུར་ནས་བུང་བ་སྒྲ་ཟི་ཟི་ཟེར་བའི་པད་མ་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་འདུག་ནས་ཆོས་སྟོན་ཏེ།
en: Dharmakāma was teaching the Dharma while on a lotus seat buzzing with bees.

source: མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཡང་དག་པར་སྟོན་ཏེ།
en: and that were uncontaminated, perfect, pure, and unsullied.

source: བྲམ་ཟེ་དེ་ནི་ལུས་ཐམས་ཅད་ནས་མེ་བྱུང་སྟེ་ཚིག་ནས་ཚིག་གོ་ཞེས་སྨྲས་ཏེ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྟུང་ངོ་།
en: “The brahmin’s entire body then burst into flames. He cried, ‘I am burning because of what I said!’ and fell into the great hells.

source: །དེ་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “The brahmin boy Dharmakāma said to him, ‘Master, do not be afraid!

source: །སློབ་དཔོན་མ་བསྙེངས་ཤིག །བདག་གིས་ཁྱོད་བསྐྱབ་པར་བགྱིའོ།
en: I will help you.’

source: །དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་དེའི་ཚེ་འདི་ལྟ་བུའི་བདེན་པའི་ཚིག་འདི་བྱས་ཏེ།
en: “At that moment the brahmin boy Dharmakāma spoke the following words of truth:

source: བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་བདག་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བྱང་ཆུབ་ལ་སྤྱོད་པའི་བདེན་པ་དང་། བདེན་པའི་ཚིག་དེས་བྲམ་ཟེ་འདིའི་ལུས་ཚིག་པ་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །སེམས་ཅན་དམྱལ་བ་ལས་ཀྱང་ལོག་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: “ ‘By the truth and the words of truth—the truth that I pursue awakening for the sake of beings—may the fire in the brahmin’s body be quelled, and may he return from the hell realms!’

source: །བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཀྱིས་བདེན་པ་དང་བདེན་པའི་ཚིག་བྱས་མ་ཐག་ཏུ་བྲམ་ཟེ་དེ་སེམས་ཅན་དམྱལ་བ་དེ་ནས་ཐར་བར་གྱུར་ཏོ།
en: “The very instant that the brahmin boy Dharmakāma spoke this truth and words of truth, the brahmin was saved from the hell realms.

source: །དགེ་སློང་དག་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེའི་ཁྱེའུ་ཆོས་འདོད་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟ་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Monks, if you suspect or have doubts that the brahmin boy named Dharmakāma who lived at that time was someone else, reconsider.
